{
    "home": "Home",
    "about": "About me",
    "services": "Services",
    "projects": "Projects",
    "contact": "Contact",


    "site-web": "websites",
    "games": "games",


    "greeting": "Hello",
    "name": "I'm Alex",
    "rol": "A Front-end developer",


    "im": "who I am",
    "description": "My name is Alexandre Eduardo Lagoa Pires and I am a Front-end developer.",
    "my-description": "I have been working on web designing and web development for 2 years. Constantly updating the technologies I already master, but also looking to learn new technologies to enrich my skills and improve my good practices as a developer.",
    "years": "Age: ",
    "from": "From: ",
    "btn-know-more": "Read more",
    "tools": "Tools",


    "design": "Design UX/UI",
    "design-info": "Design of attractive interfaces for both web and mobile users, making the most of the brand or product that the client wishes to exploit on their website",
    "development": "Web development",
    "development-info": "Creation of well-structured web pages, good responsive design, attractive color palette, with interactions that give the user satisfaction when browsing the website.",
    "maintenance": "Web maintenance",
    "maintenance-info": "Complete maintenance of web pages to detect and solve errors, update content whether text, photos, web design elements, add new functions, etc.",
    "optimization": "Website optimization",
    "optimization-info": "Complete optimization of your web page, improving loading speed, using optimized images, a good URL, to give a better experience to users who visit the website",


    "btn-more-projects": "More projects",


    "contact-info": "Contact me by: ",


    "footer-info": "Page created by Alexandre Pires",


    "about-info-1": "My name is Alex, I live in Porto, Portugal working as a Front-end Developer + Designer as Freelancer and Part-Time Photographer.",
    "about-info-2": "My journey into code started when I took a high school degree in IT Systems Management and Programming Technician (lvl 4) in which I was introduced to Front-end, Back-end, Operating Systems, How to assemble and manage Networks, together with a range of subjects such as Portuguese, Mathematics, English and all necessary to academic development. In the university I took a Sports degree, but my passion for computers always remained.",
    "about-info-3": "Before the covid outbreak I started re-learning by myself some Front-End basics like HTML, CSS and JavaScript, which led me to go back to school, this time in Porto to a Front-End Devopment bootcamp on EDIT.. There I learned more about HTML, CSS, JavaScript and also introduced me to UX Design, Responsive Web Development and React Foundations.",
    "btn-cv": "Download CV",
    "about-skills-1": "More than a year of professional experience in this language, allows me to perform without problems in the industry.",
    "about-skills-2": "More than a year of work experience in this language, I use it daily to develop web designs and interfaces.",
    "about-skills-3": "A year of experience using it in the front-end and back-end branch, allowed me to familiarize myself with the language, and include it in my work projects.",
    "about-skills-4": "One year using this preprocessor in the professional field, I include it in many of my projects since it allows me a better structured code.",
    "about-skills-5": "Less than a year using this framework, even so, I used it in countless work projects, which allowed me to get to know it for the most part.",
    "about-skills-6": "A year using this bookstore in the personal and work environment, it is one of the bookstores that I use and manipulate the most.",
    "about-skills-7": "More than a year using this JavaScript framework, carrying out multiple personal and work projects.",
    "about-skills-8": "It is the cross-platform runtime environment that I use to make my web applications scalable.",
    "about-skills-9": "It is a framework that I use mostly to be able to manage my APIs in the best way and my http execution model."
 
}
